<template>
<div class="audio-player">
  <!--音频控件-->
  <div class="audio-controls">
    <!--音频控件：开始-->
    <div class="audio-controls__start" v-if="!isPlaying" @click="play" title="播放">
      <svg t="1604247462626" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8660" width="200" height="200">
        <path d="M897.143467 597.051733l-464.648534 311.5264c-46.976 31.488-110.592 18.944-142.08-28.023466A102.4 102.4 0 0 1 273.066667 823.5264V200.4736c0-56.5504 45.8496-102.4 102.4-102.4a102.4 102.4 0 0 1 57.028266 17.348267l464.64 311.5264c46.976 31.488 59.528533 95.104 28.032 142.08a102.4 102.4 0 0 1-28.023466 28.023466z" p-id="8661"></path>
      </svg>
    </div>
    <!--音频控件：暂停-->
    <div class="audio-controls__pause" v-if="isPlaying" @click="pause" title="暂停">
      <svg t="1604247561230" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1072" width="200" height="200">
        <path d="M680 160h128c30.928 0 56 25.072 56 56v593c0 30.928-25.072 56-56 56H680c-30.928 0-56-25.072-56-56V216c0-30.928 25.072-56 56-56z m-464 0h128c30.928 0 56 25.072 56 56v593c0 30.928-25.072 56-56 56H216c-30.928 0-56-25.072-56-56V216c0-30.928 25.072-56 56-56z" p-id="1073"></path>
      </svg>
    </div>
    <!--音频信息：当前播放位置/音频长度-->
    <div class="audio-controls__time">
      {{ mm_ss(currentTime) }} / {{ mm_ss(duration) }}
    </div>
    <!--音频控件：当前播放进度-->
    <div class="audio-controls__progress" @click="onClickProgress">
      <!--音频信息：缓冲-->
      <div class="audio-loading" v-if="false">
        <svg t="1604295649488" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5200" width="200" height="200">
          <path d="M782.065385 901.683615c10.892554 18.38743 4.796721 42.970626-14.290231 53.363521-18.687226 10.892554-42.470967 4.496926-53.063726-14.290232-11.392212-18.38743-4.796721-42.470967 13.690641-53.363521 19.386747-10.792622 42.770762-4.197131 53.663316 14.290232z m-230.342539 83.243095c0 21.285449-17.587977 39.07329-39.67288 39.07329-21.285449 0-39.07329-17.388114-39.07329-39.07329v-27.381282c0-21.785108 17.887772-39.173221 39.07329-39.173222 21.785108 0 39.67288 17.388114 39.67288 39.173222v27.381282z m-241.135162-44.169806c-11.092417 19.286816-35.175954 25.382649-53.663316 14.490095-18.987021-10.692691-25.682444-34.576364-14.490095-53.663316l29.080121-50.865229c11.192349-18.687226 35.175954-25.182785 54.162975-14.490094 18.38743 10.892554 25.182785 35.175954 13.990436 53.663316l-29.080121 50.865228zM123.415634 782.764907c-18.987021 10.592759-43.270421 4.197131-53.663316-14.490095-11.092417-18.38743-4.796721-42.770762 13.990436-53.663316l78.146579-45.269054c18.687226-10.392895 42.970626-4.496926 53.663317 14.490094 10.592759 18.38743 4.097199 42.770762-14.490095 53.663316l-77.646921 45.269055zM40.27247 551.822777c-21.785108 0-39.07329-17.587977-39.07329-39.073289 0-21.785108 17.288182-39.373085 39.07329-39.373085h121.716795c21.785108 0 39.07329 17.587977 39.07329 39.07329 0 21.785108-17.288182 39.373085-39.07329 39.373084H40.27247z m43.570216-241.534888c-18.987021-10.592759-25.182785-34.576364-13.990437-53.363521 10.392895-18.987021 34.576364-25.382649 53.663317-14.490095L255.82512 319.281741c18.687226 10.692691 24.88299 34.576364 14.490094 53.063726-11.092417 18.987021-35.175954 25.082854-53.563384 14.490095l-132.909144-76.547673z m158.591587-187.072119l92.137016 159.990632c11.192349 18.687226 35.175954 25.382649 53.86318 14.290231 18.687226-10.592759 24.88299-34.876159 13.990436-53.663316L309.888162 84.142481C299.295404 65.655119 275.311799 58.959696 256.824436 69.852249c-18.987021 10.892554-25.082854 34.976091-14.390163 53.363521z m230.642335-82.643505c0-21.285449 17.887772-39.373085 39.07329-39.373085 21.785108 0 39.67288 17.687909 39.672879 39.373085V224.846296c0 21.785108-17.587977 39.373085-39.672879 39.67288-21.285449 0-39.07329-17.288182-39.07329-39.67288V40.572265z m241.135161 43.570216c11.192349-18.987021 34.876159-25.182785 53.663316-14.490095 18.987021 10.592759 25.682444 34.576364 14.490095 53.663316l-92.336879 159.990632c-10.392895 18.687226-34.976091 25.282717-53.663316 14.490094-18.687226-10.892554-24.88299-35.175954-14.290231-53.963111l92.137015-159.690836z m187.671709 158.291792L741.692983 334.771153c-18.687226 10.592759-25.182785 34.576364-14.490094 53.663316 11.092417 18.38743 35.175954 24.583195 53.663316 14.290231l160.290426-92.336879c18.38743-10.592759 25.182785-34.576364 13.990436-53.363521-10.792622-18.987021-34.876159-25.782375-53.263589-14.590027z m82.34371 230.94213c21.984971 0 39.373085 17.587977 39.07329 39.373085 0 21.485313-16.988387 39.07329-39.07329 39.073289H799.753294c-21.285449 0-39.173221-17.587977-39.173222-39.373084 0-21.485313 17.887772-39.07329 39.173222-39.07329h184.473894z" fill="#999999" p-id="5201"></path>
        </svg>
      </div>

      <div ref="progress" class="audio-controls__progress-outer">
        <div class="audio-controls__progress-inner" :style="{ width: percentage + '%' }"></div>
        <div class="audio-controls__progress-point" :style="{ left: percentage + '%' }"></div>
      </div>
    </div>
    <!--音频控件：音量-->
    <div class="audio-controls__volume" title="音量">
      <svg t="1604298857042" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3802" width="200" height="200">
        <path d="M596 139c16.71 16.242 26 38.634 26 62v624c0 48.608-39.423 88-88 88-23.423 0-45.833-9.282-62-26L312.059 727.059A48 48 0 0 0 278.118 713H216c-70.657 0.295-128-57.003-128-128V441c0-70.338 57.343-127.636 128-128h61.198a48 48 0 0 0 33.844-13.962L472 139c34.021-34.576 89.774-34.604 124 0z m219.153 132.989C883.63 332.312 924 422.217 924 518.999c0 96.784-40.37 186.689-108.847 247.012-13.262 11.683-33.482 10.403-45.165-2.859-11.682-13.261-10.402-33.482 2.86-45.164C827.493 669.849 860 597.455 860 519s-32.507-150.85-87.152-198.988c-13.262-11.682-14.542-31.903-2.86-45.164 11.683-13.262 31.903-14.542 45.165-2.86z m-95.508 93.39C760.867 403.048 785 458.494 785 517.973c0 59.513-24.161 114.988-65.425 152.659-13.052 11.915-33.292 10.994-45.208-2.058-11.796-12.922-11.011-32.888 1.67-44.848l0.388-0.36 0.834-0.768C704.657 597.13 721 559.193 721 517.974c0-41.613-16.656-79.88-44.53-105.352-13.045-11.922-13.956-32.163-2.034-45.209 11.922-13.046 32.163-13.957 45.209-2.035z" fill="#333333" p-id="3803"></path>
      </svg>
      <div ref="volume" class="audio-controls__volume-wrapper" @click="onClickVolume">
        <div class="audio-controls__volume-outer">
          <div class="audio-controls__volume-inner" :style="{ width: volume + '%' }"></div>
          <div class="audio-controls__volume-point" :style="{ left: volume + '%' }"></div>
        </div>
      </div>
    </div>
  </div>
  <!--音频播放器-->
  <audio ref="audio" class="audio-player__audio" :src="src" @progress="onProgress" @canplaythrough="onCanPlayThrough" @ended="onEnded" @timeupdate="onTimeUpdate">
    您的浏览器不支持 audio 标签。
  </audio>
</div>
</template>

<script>
export default {
  name: "AudioPlayer",
  components: {},
  props: {
    // 播放列表
    src: {
      type: String,
      default: null,
    },
    // 是否循环播放
    loop: {
      type: Boolean,
      default: false,
    },
  },
  data() {
    return {
      playMode: "list", // 播放模式：单曲循环，顺序播放，循环播放，随机播放
      currentIndex: 0, // 当前播放的音频位置索引
      isPlaying: false, // 音频是否正在播放
      volume: 66, // 音频音量
      currentTime: 0, // 音频当前播放位置
      duration: 0, // 音频长度
    };
  },
  computed: {
    percentage: function () {
      return (this.currentTime / this.duration) * 100;
    },
  },
  methods: {
    // 调整音量
    onClickVolume(e) {
      this.$refs.audio.volume = e.offsetX / this.$refs.volume.offsetWidth;
      this.volume = this.$refs.audio.volume * 100;
      this.$emit("volume-change", this.volume);
    },
    //调整进度
    onClickProgress(e) {
      this.currentTime =
        (e.offsetX / this.$refs.progress.offsetWidth) * this.duration;
      this.$refs.audio.currentTime = this.currentTime;
      this.$emit("progress-change", this.volume);
    },
    // 秒转为分:秒
    mm_ss(val) {
      return (
        ("00" + parseInt(val / 60)).slice(-2) +
        ":" +
        ("00" + parseInt(val % 60)).slice(-2)
      );
    },
    // 播放
    play() {
      this.$emit("before-play");
      this.$refs.audio.play();
      this.isPlaying = true;
    },
    // 暂停
    pause() {
      this.$emit("before-pause");
      this.$refs.audio.pause();
      this.isPlaying = false;
    },
    // 客户端正在请求数据，缓冲中
    onProgress() {
      this.duration = this.$refs.audio.duration;
    },
    // 歌曲已经载入完全
    onCanPlayThrough() {
      console.log("onCanPlayThrough");
      if (this.isPlaying) {
        this.play();
      }
    },
    // 音频的播放是否已结束
    onEnded() {
      // 循环播放
      if (this.loop) {
        this.$refs.audio.play();
        return;
      }
      this.isPlaying = false;
      this.$emit("ended");
    },
    onTimeUpdate() {
      this.currentTime = this.$refs.audio.currentTime;
      this.$emit("playing", this.currentTime);
    },
  },
};
</script>

<style lang="scss">
@import "index";
</style>
